modules/OpenQBMM/tutorials/diluteVdfTransportFoam/bubbleColumn/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     diluteCoupledHyperbolicFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         250;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;

functions
{
    fieldAverage
    {
        type            fieldAverage;
        libs            (libfieldFunctionObjects);
        writeControl    writeTime;
        timeStart       50;
        fields
        (
            alpha.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            U.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            U.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            p
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.000.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.100.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.200.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.300.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.400.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.500.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
        );
    }
}


// ************************************************************************* //
